app/controllers/api/jobs_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "users" SET "job_assigned" = $1 WHERE "users"."id" = $2  [["job_assigned", false], ["id", 6]]
---
  def reject_job
    @user=User.find(current_user.id)
    @job = Job.where(:user_id => current_user.id).first
    if @job.present?
      if @job.status == "Pending"
        if @job.update_columns(user_id: nil ) && @user.update_columns(job_assigned: false )

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "users" SET "job_assigned" = $1 WHERE "users"."id" = $2  [["job_assigned", false], ["id", 6]]
---
  def close_job
    @job = Job.where(:user_id => current_user.id).first
    @user=User.find(current_user.id)
    if @job.present?
      if @job.status == "Accepted"
        if @job.update_columns(status: "Complete",user_id: nil ) && @user.update_columns(job_assigned: false )