app/controllers/api/user_controller.rb

  def show

    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT $2  [["uid", "driver@example.com"], ["LIMIT", 1]]