app/controllers/jobs_controller.rb

SELECT  "notifications".* FROM "notifications" WHERE "notifications"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "notifications" WHERE "notifications"."id" = $1  [["id", 30]]
---
  def accept_job
    @notification=Notification.find(params[:notification_id])
    @job = Job.find(params[:job_id])
    if @job.update_columns(status: "Accepted")
      @notification.destroy

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "notifications".* FROM "notifications" WHERE "notifications"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]
UPDATE "users" SET "job_assigned" = $1 WHERE "users"."id" = $2  [["job_assigned", false], ["id", 6]]
DELETE FROM "notifications" WHERE "notifications"."id" = $1  [["id", 37]]
---
  def reject_job
    @user=User.find(current_user.id)
    @notification=Notification.find(params[:notification_id])
    @job = Job.find(params[:job_id])
    if @job.update_columns(status: "Pending",user_id: nil ) && @user.update_columns(job_assigned: false )
      @notification.destroy

SELECT "users".* FROM "users" WHERE "users"."user_type" = $1 AND "users"."job_assigned" = $2  [["user_type", "User"], ["job_assigned", false]]
---
  def assignjob
    @job = Job.find(params[:job_id])
    @users = User.where(:user_type => "User",:job_assigned => false)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "job_assigned" = $1 WHERE "users"."id" = $2  [["job_assigned", true], ["id", 7]]
INSERT INTO "notifications" ("user_id", "created_at", "updated_at", "job_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 7], ["created_at", "2019-08-02 11:29:44.171932"], ["updated_at", "2019-08-02 11:29:44.171932"], ["job_id", 13]]
---
  def assign_job_update
    @user=User.find(params[:job][:user_id])

    @job = Job.find(params[:job_id])
    @job.status = "Pending"
    if @job.update(job_params) && @user.update_columns(job_assigned: true )
      redirect_to @job
    else
      render 'jobs/assignjob'

    end

    @notification =Notification.new(user_id: params[:job][:user_id],job_id: params[:job_id])
    @notification.save

SELECT  "notifications".* FROM "notifications" WHERE "notifications"."job_id" = $1 LIMIT $2  [["job_id", 31], ["LIMIT", 1]]
SELECT  "notifications".* FROM "notifications" WHERE "notifications"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  "notifications".* FROM "notifications" WHERE "notifications"."job_id" = $1 LIMIT $2  [["job_id", 1], ["LIMIT", 1]]
DELETE FROM "notifications" WHERE "notifications"."id" = $1  [["id", 65]]
UPDATE "users" SET "job_assigned" = $1 WHERE "users"."id" = $2  [["job_assigned", false], ["id", 5]]
---
  def close_job

    @job = Job.find(params[:job_id])
    @notification=Notification.find_by_job_id(@job.id)
    @user=User.find(@job.user_id)

    if @notification.present?
      @notification.destroy
    end

    if @job.update_columns(status: "Complete",user_id: nil ) && @user.update_columns(job_assigned: false )