app/controllers/notifications_controller.rb

  def index
  @notifications=Notification.where(:user_id => current_user.id )
---
SELECT "notifications".* FROM "notifications" WHERE "notifications"."user_id" = $1  [["user_id", 5]]