app/controllers/user_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."user_type" = $1 LIMIT $2  [["user_type", "User"], ["LIMIT", 1]]
---
  def index
    @users = User.where(:user_type => "User")